org/2014-04-16-scala.org
#+STARTUP: showall indent
#+STARTUP: hidestars
#+OPTIONS:   H:2 num:nil toc:nil \n:nil ::t |:t -:t f:t *:t <:t
#+OPTIONS:   tex:t  d:nil todo:t pri:nil tags:not-in-toc
#+BEGIN_HTML
---
category: computer science and enginneering
layout: post
title: "Refresh some Knowledge about Language through Scala"
tags: ["Language", Scala]
---
{% include JB/setup %}

#+END_HTML

由于spark[fn:2]是用scala语言实现的，不得不又学习一门新的语言：集函数式和面向
对象于一身的语言。在学习 Programming in Scala[fn:1]，确实又有很多值得
刷新的知识，必须先记录的有： 模式匹配(pattern match)、不可变和可变、多
重继承、协变和逆变、按名参数(call-by-name parameters)和Actor模式

** case classes
case classes 是用在模式匹配中的特殊的类。当定义class时，如果用了case修饰符
，编译器将为你做四件事情：
- 添加一个以类名命名的工厂方法，意味着：
#+BEGIN_SRC emacs-lisp -n -r
case class Var(x: String)
val a = Var("x") //产生一个对象

class Varr(x: String)
val b = Varr("x") // error: not found: value Varr

val b = new Varr("x")
#+END_SRC

- 参数列表中的所有参数都会被编译器自动添加一个val前缀，使得每个参数都
  成为一个字段。
#+BEGIN_SRC emacs-lisp -n -r
scala> case class Var(x: String)
scala> val a= new Var("x")
scala> a.x
res9: String = x

class Varr(x: String)
val b = new Varr("x") //error: value x is not a member of Varr

scala> class Var(val x: String)

OR

scala> class Var(y: String) {
     | def x = y }

scala> val b = new Varr("x")
b: Varr = Varr@4bbbd16b

scala> b.x
res7: String = x
#+END_SRC

- 编译器给case classes自动添加toString、hashCode和equals的实现。那将会
  print、hash和compare包含其类和所有它的参数的整棵树。另外，因
  为”==“总是委托给euqals，意味着case classes的元素总是在结构上被比较。
#+BEGIN_SRC emacs-lisp -n -r
scala> println(op)
BinOp(+,Number(1.0),Var(x))
scala> op.right == Var("x")
res3: Boolean = true
#+END_SRC

- 编译器添加了一个copy方法到case classes中，用于被修改的copy。
#+BEGIN_SRC emacs-lisp -n -r
scala> op.copy(operator = "-")
res4: BinOp = BinOp(-,Number(1.0),Var(x))
#+END_SRC

**  模式匹配[fn:3] [fn:4]
    通常情况下，模式匹配是一种技术，它对一些对象进行命名并且使用已知的
    结构将数据结构和对象分解成该技术内部的组成元素，对Scala而言，它的
    模式匹配有case classes、extractor等种类，每一种内部都有自己的组成
    元素。
    scala的match表达式可以看成为java风格的switch，即一个java的switch能
    表达成match表达式，其中每个模式是一个常量，且最后是一 个通配符
    default。但区别表现在三个方面：(1) scala的match是一个表达式，例如
    它总是产生一个值(java的switch是一个语句称为statement) (2)scala的选
    项表达式从不会转入到下一个case中(java的case必须有break来达到该目的)
    (3) 如果都不匹配，将会抛出MatchError，java的default是可有可无的，
    即没有default不会抛出异常。另外，也是最重要的，scala不仅能匹配java
    所支持的有限的基本数据类型和基本数据类型的封装匹配，它通过case
    classes支持构造器模式(constructor pattern)外，还有通配符模式
    (wildcard pattern)、常量模式(constant pattern)、变量模式(variable
    pattern)、序列模式(sequence pattern)、元组模式(tuple pattern)和类
    型模式(typed pattern)

Scala的模式匹配的理论来自于论文“A Term Pattern-Match Compiler
Inspired by Finite Automata Theory"，在Burak Emir的博士论文“Object-Oriented Pattern
Matching”，描述了其理论与实现。

- 通配符模式
#+BEGIN_SRC emacs-lisp -n -r
expr match {
case BinOp(op, left, right) => println(expr +" is a binary operation") 
case _ =>  // "_"支持任何对像
}
#+END_SRC

- 常量模式
#+BEGIN_SRC emacs-lisp -n -r
def describe(x: Any) = x match {
case 5 => "five"
case true => "truth"
case "hello" => "hi!"
case Nil => "the empty list"
case _ => "something else"
}
#+END_SRC

- 变量模式
#+BEGIN_SRC emacs-lisp -n -r
val pi = math.Pi
E match {
case pi => "strange math? Pi = "+ pi
}
#+END_SRC   

- 构造器模式
构造器模式(Constructor patterns)可以用于定义所谓的深度匹配(deep matches)。
#+BEGIN_SRC emacs-lisp -n -r
ex1.
abstract class Expr
case class Var(name: String) extends Expr
case class Number(num: Double) extends Expr
expr match {
case BinOp("+", e, Number(0)) => println("a deep match")
case _ =>

ex2.
注： x :: xs1 为右结合，其::是一个类，表示为： 
::(xs1, x) 参考 section 22.1的 The :: class
def rev[T](xs: List[T]): List[T] = xs match {
case List() => xs
case x :: xs1 => rev(xs1) ::: List(x) 
}
}
#+END_SRC

Scala允许在模式表达式后面规定条件,这些条件称为模式警卫(pattern guards)。
如下例的line [[(guards)]]：
#+BEGIN_SRC emacs-lisp -n -r
val salaryTable = new Table(200,100) {
    reactions += {
    case TableUpdated(salaryTable, rows, cols)
        if cols % 2 == 0 => // ... (ref:guards)
   }
}

#+END_SRC
- 序列模式
类型有：List 和 Array
#+BEGIN_SRC emacs-lisp -n -r
ex1.
expr match {
case List(0, _, _) => println("found it")
case _ =>
}

ex2
//注：_* 用于匹配任意长度的列表
expr match {
case List(0, _*) => println("found it")
case _ =>
}
#+END_SRC

- 元组模式
#+BEGIN_SRC emacs-lisp -n -r
def tupleDemo(expr: Any) =
expr match {
case (a, b, c) => println("matched "+ a + b + c)
case _ =>
}
#+END_SRC

- 类型模式
#+BEGIN_SRC emacs-lisp -n -r
def generalSize(x: Any) = x match {
case s: String => s.length
case m: Map[_, _] => m.size
case _ => 1
}
#+END_SRC

