_posts/2014-04-16-scala.html
---
category: computer science and enginneering
layout: post
title: "Refresh some Knowledge about Language through Scala"
tags: ["Language", Scala]
---
{% include JB/setup %}

<p>
由于spark<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>是用scala语言实现的，不得不又学习一门新的语言：集函数式和面向
对象于一身的语言。在学习 Programming in Scala<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>，确实又有很多值得
刷新的知识，必须先记录的有： 模式匹配(pattern match)、不可变和可变、多
重继承、协变和逆变、按名参数(call-by-name parameters)和Actor模式
</p>

<div id="outline-container-sec-0-1" class="outline-3">
<h3 id="sec-0-1">case classes</h3>
<div class="outline-text-3" id="text-0-1">
<p>
case classes 是用在模式匹配中的特殊的类。当定义class时，如果用了case修饰符
，编译器将为你做四件事情：
</p>
<ul class="org-ul">
<li>添加一个以类名命名的工厂方法，意味着：
</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="linenr">1: </span>case class Var(x: String)
<span class="linenr">2: </span>val a = Var(<span style="color: #8abeb7;">"x"</span>) //&#20135;&#29983;&#19968;&#20010;&#23545;&#35937;
<span class="linenr">3: </span>
<span class="linenr">4: </span>class Varr(x: String)
<span class="linenr">5: </span>val b = Varr(<span style="color: #8abeb7;">"x"</span>) // error: not found: value Varr
<span class="linenr">6: </span>
<span class="linenr">7: </span>val b = new Varr(<span style="color: #8abeb7;">"x"</span>)
</pre>
</div>

<ul class="org-ul">
<li>参数列表中的所有参数都会被编译器自动添加一个val前缀，使得每个参数都
成为一个字段。
</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="linenr"> 1: </span>scala&gt; case class Var(x: String)
<span class="linenr"> 2: </span>scala&gt; val a= new Var(<span style="color: #8abeb7;">"x"</span>)
<span class="linenr"> 3: </span>scala&gt; a.x
<span class="linenr"> 4: </span>res9: String = x
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>class Varr(x: String)
<span class="linenr"> 7: </span>val b = new Varr(<span style="color: #8abeb7;">"x"</span>) //error: value x is not a member of Varr
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>scala&gt; class Var(val x: String)
<span class="linenr">10: </span>
<span class="linenr">11: </span>OR
<span class="linenr">12: </span>
<span class="linenr">13: </span>scala&gt; class Var(y: String) {
<span class="linenr">14: </span>     | def x = y }
<span class="linenr">15: </span>
<span class="linenr">16: </span>scala&gt; val b = new Varr(<span style="color: #8abeb7;">"x"</span>)
<span class="linenr">17: </span>b: Varr = Varr@4bbbd16b
<span class="linenr">18: </span>
<span class="linenr">19: </span>scala&gt; b.x
<span class="linenr">20: </span>res7: String = x
</pre>
</div>

<ul class="org-ul">
<li>编译器给case classes自动添加toString、hashCode和equals的实现。那将会
print、hash和compare包含其类和所有它的参数的整棵树。另外，因
为”==“总是委托给euqals，意味着case classes的元素总是在结构上被比较。
</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="linenr">1: </span>scala&gt; println(op)
<span class="linenr">2: </span>BinOp(+,Number(1.0),Var(x))
<span class="linenr">3: </span>scala&gt; op.right == Var(<span style="color: #8abeb7;">"x"</span>)
<span class="linenr">4: </span>res3: Boolean = true
</pre>
</div>

<ul class="org-ul">
<li>编译器添加了一个copy方法到case classes中，用于被修改的copy。
</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="linenr">1: </span>scala&gt; op.copy(operator = <span style="color: #8abeb7;">"-"</span>)
<span class="linenr">2: </span>res4: BinOp = BinOp(-,Number(1.0),Var(x))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-0-2" class="outline-3">
<h3 id="sec-0-2">模式匹配<sup><a id="fnr.3" name="fnr.3" class="footref" href="#fn.3">3</a></sup> <sup>, </sup><sup><a id="fnr.4" name="fnr.4" class="footref" href="#fn.4">4</a></sup></h3>
<div class="outline-text-3" id="text-0-2">
<p>
通常情况下，模式匹配是一种技术，它对一些对象进行命名并且使用已知的
结构将数据结构和对象分解成该技术内部的组成元素，对Scala而言，它的
模式匹配有case classes、extractor等种类，每一种内部都有自己的组成
元素。
scala的match表达式可以看成为java风格的switch，即一个java的switch能
表达成match表达式，其中每个模式是一个常量，且最后是一 个通配符
default。但区别表现在三个方面：(1) scala的match是一个表达式，例如
它总是产生一个值(java的switch是一个语句称为statement) (2)scala的选
项表达式从不会转入到下一个case中(java的case必须有break来达到该目的)
(3) 如果都不匹配，将会抛出MatchError，java的default是可有可无的，
即没有default不会抛出异常。另外，也是最重要的，scala不仅能匹配java
所支持的有限的基本数据类型和基本数据类型的封装匹配，它通过case
classes支持构造器模式(constructor pattern)外，还有通配符模式
(wildcard pattern)、常量模式(constant pattern)、变量模式(variable
pattern)、序列模式(sequence pattern)、元组模式(tuple pattern)和类
型模式(typed pattern)
</p>

<p>
Scala的模式匹配的理论来自于论文“A Term Pattern-Match Compiler
Inspired by Finite Automata Theory"，在Burak Emir的博士论文“Object-Oriented Pattern
Matching”，描述了其理论与实现。
</p>

<ul class="org-ul">
<li>通配符模式
</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="linenr">1: </span>expr match {
<span class="linenr">2: </span>case BinOp(op, left, right) =&gt; println(expr +<span style="color: #8abeb7;">" is a binary operation"</span>) 
<span class="linenr">3: </span>case _ =&gt;  // <span style="color: #8abeb7;">"_"</span>&#25903;&#25345;&#20219;&#20309;&#23545;&#20687;
<span class="linenr">4: </span>}
</pre>
</div>

<ul class="org-ul">
<li>常量模式
</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="linenr">1: </span>def describe(x: Any) = x match {
<span class="linenr">2: </span>case 5 =&gt; <span style="color: #8abeb7;">"five"</span>
<span class="linenr">3: </span>case true =&gt; <span style="color: #8abeb7;">"truth"</span>
<span class="linenr">4: </span>case <span style="color: #8abeb7;">"hello"</span> =&gt; <span style="color: #8abeb7;">"hi!"</span>
<span class="linenr">5: </span>case Nil =&gt; <span style="color: #8abeb7;">"the empty list"</span>
<span class="linenr">6: </span>case _ =&gt; <span style="color: #8abeb7;">"something else"</span>
<span class="linenr">7: </span>}
</pre>
</div>

<ul class="org-ul">
<li>变量模式
</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="linenr">1: </span>val pi = math.Pi
<span class="linenr">2: </span>E match {
<span class="linenr">3: </span>case pi =&gt; <span style="color: #8abeb7;">"strange math? Pi = "</span>+ pi
<span class="linenr">4: </span>}
</pre>
</div>

<ul class="org-ul">
<li>构造器模式
</li>
</ul>
<p>
构造器模式(Constructor patterns)可以用于定义所谓的深度匹配(deep matches)。
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="linenr"> 1: </span>ex1.
<span class="linenr"> 2: </span>abstract class Expr
<span class="linenr"> 3: </span>case class Var(name: String) extends Expr
<span class="linenr"> 4: </span>case class Number(num: Double) extends Expr
<span class="linenr"> 5: </span>expr match {
<span class="linenr"> 6: </span>case BinOp(<span style="color: #8abeb7;">"+"</span>, e, Number(0)) =&gt; println(<span style="color: #8abeb7;">"a deep match"</span>)
<span class="linenr"> 7: </span>case _ =&gt;
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>ex2.
<span class="linenr">10: </span>&#27880;&#65306; x <span style="color: #b294bb;">::</span> xs1 &#20026;&#21491;&#32467;&#21512;&#65292;&#20854;::&#26159;&#19968;&#20010;&#31867;&#65292;&#34920;&#31034;&#20026;&#65306; 
<span class="linenr">11: </span><span style="color: #b294bb;">::</span>(xs1, x) &#21442;&#32771; section 22.1&#30340; The <span style="color: #b294bb;">::</span> class
<span class="linenr">12: </span>def rev[T](xs: List[T]): List[T] = xs match {
<span class="linenr">13: </span>case List() =&gt; xs
<span class="linenr">14: </span>case x <span style="color: #b294bb;">::</span> xs1 =&gt; rev(xs1) <span style="color: #b294bb;">:::</span> List(x) 
<span class="linenr">15: </span>}
<span class="linenr">16: </span>}
</pre>
</div>

<p>
Scala允许在模式表达式后面规定条件,这些条件称为模式警卫(pattern guards)。
如下例的line <a href="#coderef-guards"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-guards');" onmouseout="CodeHighlightOff(this, 'coderef-guards');">4</a>：
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="linenr">1: </span>val salaryTable = new Table(200,100) {
<span class="linenr">2: </span>    reactions += {
<span class="linenr">3: </span>    case TableUpdated(salaryTable, rows, cols)
<span id="coderef-guards" class="coderef-off"><span class="linenr">4: </span>        if cols % 2 == 0 =&gt; // ...</span>
<span class="linenr">5: </span>   }
<span class="linenr">6: </span>}
</pre>
</div>
<ul class="org-ul">
<li>序列模式
</li>
</ul>
<p>
类型有：List 和 Array
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="linenr"> 1: </span>ex1.
<span class="linenr"> 2: </span>expr match {
<span class="linenr"> 3: </span>case List(0, _, _) =&gt; println(<span style="color: #8abeb7;">"found it"</span>)
<span class="linenr"> 4: </span>case _ =&gt;
<span class="linenr"> 5: </span>}
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>ex2
<span class="linenr"> 8: </span>//&#27880;&#65306;_* &#29992;&#20110;&#21305;&#37197;&#20219;&#24847;&#38271;&#24230;&#30340;&#21015;&#34920;
<span class="linenr"> 9: </span>expr match {
<span class="linenr">10: </span>case List(0, _*) =&gt; println(<span style="color: #8abeb7;">"found it"</span>)
<span class="linenr">11: </span>case _ =&gt;
<span class="linenr">12: </span>}
</pre>
</div>

<ul class="org-ul">
<li>元组模式
</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="linenr">1: </span>def tupleDemo(expr: Any) =
<span class="linenr">2: </span>expr match {
<span class="linenr">3: </span>case (a, b, c) =&gt; println(<span style="color: #8abeb7;">"matched "</span>+ a + b + c)
<span class="linenr">4: </span>case _ =&gt;
<span class="linenr">5: </span>}
</pre>
</div>

<ul class="org-ul">
<li>类型模式
</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="linenr">1: </span>def generalSize(x: Any) = x match {
<span class="linenr">2: </span>case s: String =&gt; s.length
<span class="linenr">3: </span>case m: Map[_, _] =&gt; m.size
<span class="linenr">4: </span>case _ =&gt; 1
<span class="linenr">5: </span>}
</pre>
</div>
</div>
</div>
