org/2014-04-16-scala.org
** 模式匹配的用例
模式匹配无处不在，需要对此有深入的理解，才可以看到它的精髓和发挥到极致。
- 变量定义
#+BEGIN_SRC emacs-lisp -n -r
scala> val myTuple = (123, "abc")
myTuple: (Int, java.lang.String) = (123,abc)
scala> val (number, string) = myTuple
number: Int = 123
string: java.lang.String = abc
#+END_SRC
- 用多个case构建部分函数
在大括号中的多个case能出现在可以定义函数的任何地方。一个case就是一个函数定
义，只是更普遍。

部分函数： 只能对定义域中的部分值进行求值的函数。

这样的的case序列用于形成部分函数(partial function)。如果传递了一个不被
支持的参数给这样的函数，将会产生一个运行时的异常。
#+BEGIN_SRC emacs-lisp -n -r
val second: List[Int] => Int = {
case x :: y :: _ => y
}

scala> second(List())
scala.MatchError: List()
at $anonfun$1.apply(<console>:17)
at $anonfun$1.apply(<console>:17)
#+END_SRC
如果想要明确定义一个部分函数，必须首先让编译器知道要使用部分函数。像上
面的定义 List[Int] => Int 则包括了从Int列表到Int映射的全部函数，不管是
否这个函数是部分的(因为这里没有列出所有情况)。如果想要只包含部分函数，
则需要使用关键字PartialFunction，写成PartialFunction[List[Int], Int]。
如下定义一个部分函数类型：
#+BEGIN_SRC emacs-lisp -n -r
val second: PartialFunction[List[Int],Int] = { (ref:part)
case x :: y :: _ => y
}
#+END_SRC

部分函数有个方法isDefinedAt，它用于测试该函数是否在某些特定值中进行了
定义。这样一来，上面的例子无论遇到什么样Int列表，都会有两个元素true和
false。因此line [[(part)]] 经过编译器翻译时，要翻译两次，一次是真实的
函数实现，一次是对应的isDefinedAt，上面的定义翻译如下：
#+BEGIN_SRC emacs-lisp -n -r
new PartialFunction[List[Int], Int] {
def apply(xs: List[Int]) = xs match {
case x :: y :: _ => y
}
def isDefinedAt(xs: List[Int]) = xs match {
case x :: y :: _ => true
case _ => false
}
}
#+END_SRC
只要出现PartialFunction的地方就会进行这样的翻译，如果申明为Function1或
没有类型，(只有 => )则翻译成全函数。

- for表达式中的模式匹配
#+BEGIN_SRC emacs-lisp -n -r
scala> for ((country, city) <capitals)
println("The capital of "+ country +" is "+ city)
The capital of France is Paris
The capital of Japan is Tokyo

scala> val results = List(Some("apple"), None,
Some("orange"))
results: List[Option[java.lang.String]] = List(Some(apple),
None, Some(orange))
scala> for (Some(fruit) <results)
println(fruit)
apple
orange
#+END_SRC
第2个例子，可以明显看到模式匹配的痕迹。

** 不可变的数据结构(immutable data structure) 
scala提供了函数式编程语言重要的基石，那就是不可变的数据结构。并且，
scala在java API的基础上提供了很多不可变的数据类型，如List、Tuple、Map
和Set。

** 引用透明性(referencially transparent)
函数编程的思想还包括：方法或称函数不应该有副作用(side effects)，这些方
法只是通过参数和返回结果与他们的环境进行交互。这样的方法称为引用透明性，
那意味着，对于给定的输入，方法调用能用它的返回结果替换，而不会影响程序
的语义。
举例如下：
#+BEGIN_SRC emacs-lisp -n -r
def add(x: Int, y: Int): Int = {
   x + y
}

val (a, b) = (13,14)
val c = add(a,b) (ref:add)

def add2(x: Int, y: Int): Int = {
    println("a + b = " + (x + y))
    x + y
}

val c = add2(a,b) (ref:add2)
#+END_SRC
在第 [[(add)]] 行调用 add 函数调用的位置，可用 27 代替，不会影响程序的语义，
而在 第 [[(add2)]] 行，如果用 27 代替 add2 函数调用，就与程序原有的语
义不一致，因为函数add2()有副作用：打印语句。

** trait
Scala 使用trait，使其看起来有点像多重继承，值得提到的，有如下几点，第一，
trait像Java的接口，而它们也有方法实现，具有<松本行弘的程序世界>说的
 实现继承(另一种继承叫规格继承，如class)能力，甚至有成员变量(fields)；第二，
不像类，trait能加新的功能到一个未确定的超类中；第三，对super的解释，多
重继承中，被super调用的方法在调用的位置确定，但是使用trait，被调用的方
法通过类的线性化(linearizatioin)来确定并将traits混合进类中，也即trait
的super调用，如super.toString()，是动态绑定的，而abstract class或class
是静态绑定的，就这个区别使能了以堆栈方式进行修改，举例如下：
#+BEGIN_SRC emacs-lisp -n -r -r
abstract class IntQueue {
  def get(): Int
  def put(x: Int)
}

import scala.collection.mutable.ArrayBuffer

class BasicIntQueue extends IntQueue {
  private val buf = new ArrayBuffer[Int]
  def get() = buf.remove(0)
  def put(x: Int) { buf += x }
}

trait Doubling extends IntQueue {
  abstract override def put(x: Int) { super.put(2 * x) } (ref:double)
}

trait Incrementing extends IntQueue { 
  abstract override def put(x: Int) (ref:incrementing) 
      { super.put(x + 1) } (ref:super-put)
}

trait Filtering extends IntQueue {
  abstract override def put(x: Int) { (ref:filtering)
    if (x >= 0) super.put(x) 
  }
}

scala> val q = new BasicIntQueue with Doubling with Incrementing  (ref:stack1)
q: BasicIntQueue with Doubling with Incrementing = $anon$1@60c8fab

scala> q.put(42)

scala> q.get()
res12: Int = 86

scala> val q = new BasicIntQueue with Incrementing with Doubling (ref:stack2)
q: BasicIntQueue with Incrementing with Doubling = $anon$1@2a7a3919

scala> q.put(42)

scala> q.get()
res14: Int = 85

#+END_SRC
line [[(stack1)]]  和 line [[(stack2)]] 的 with Doubling with
Incrementing 和 with Incrementing with Doubling， 顺序的不同，所产生的
结果是不同的，明显地看到堆栈的痕迹，同时也可以理解super为什么需要动态
绑定，如line [[(super-put)]] 的 super.put，由于自己在继承类中位置的不
同，所使用的super肯定不同。

另外，代码中的line [[(double)]] [[(incrementing)]] [[(filtering)]]
使用了 abstract override 是专门用于修改超类中某一方法时，所必须的特定语
法。

