_posts/2014-04-16-scala.html

<div id="outline-container-sec-0-3" class="outline-3">
<h3 id="sec-0-3">模式匹配的用例</h3>
<div class="outline-text-3" id="text-0-3">
<p>
模式匹配无处不在，需要对此有深入的理解，才可以看到它的精髓和发挥到极致。
</p>
<ul class="org-ul">
<li>变量定义
</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="linenr">1: </span>scala&gt; val myTuple = (123, <span style="color: #8abeb7;">"abc"</span>)
<span class="linenr">2: </span>myTuple: (Int, java.lang.String) = (123,abc)
<span class="linenr">3: </span>scala&gt; val (number, string) = myTuple
<span class="linenr">4: </span>number: Int = 123
<span class="linenr">5: </span>string: java.lang.String = abc
</pre>
</div>
<ul class="org-ul">
<li>用多个case构建部分函数
</li>
</ul>
<p>
在大括号中的多个case能出现在可以定义函数的任何地方。一个case就是一个函数定
义，只是更普遍。
</p>

<p>
部分函数： 只能对定义域中的部分值进行求值的函数。
</p>

<p>
这样的的case序列用于形成部分函数(partial function)。如果传递了一个不被
支持的参数给这样的函数，将会产生一个运行时的异常。
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="linenr">1: </span>val second: List[Int] =&gt; Int = {
<span class="linenr">2: </span>case x <span style="color: #b294bb;">::</span> y <span style="color: #b294bb;">::</span> _ =&gt; y
<span class="linenr">3: </span>}
<span class="linenr">4: </span>
<span class="linenr">5: </span>scala&gt; second(List())
<span class="linenr">6: </span>scala.MatchError: List()
<span class="linenr">7: </span>at $anonfun$1.apply(&lt;console&gt;:17)
<span class="linenr">8: </span>at $anonfun$1.apply(&lt;console&gt;:17)
</pre>
</div>
<p>
如果想要明确定义一个部分函数，必须首先让编译器知道要使用部分函数。像上
面的定义 List[Int] =&gt; Int 则包括了从Int列表到Int映射的全部函数，不管是
否这个函数是部分的(因为这里没有列出所有情况)。如果想要只包含部分函数，
则需要使用关键字PartialFunction，写成PartialFunction[List[Int], Int]。
如下定义一个部分函数类型：
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span id="coderef-part" class="coderef-off"><span class="linenr">1: </span>val second: PartialFunction[List[Int],Int] = {</span>
<span class="linenr">2: </span>case x <span style="color: #b294bb;">::</span> y <span style="color: #b294bb;">::</span> _ =&gt; y
<span class="linenr">3: </span>}
</pre>
</div>

<p>
部分函数有个方法isDefinedAt，它用于测试该函数是否在某些特定值中进行了
定义。这样一来，上面的例子无论遇到什么样Int列表，都会有两个元素true和
false。因此line <a href="#coderef-part"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-part');" onmouseout="CodeHighlightOff(this, 'coderef-part');">1</a> 经过编译器翻译时，要翻译两次，一次是真实的
函数实现，一次是对应的isDefinedAt，上面的定义翻译如下：
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="linenr">1: </span>new PartialFunction[List[Int], Int] {
<span class="linenr">2: </span>def apply(xs: List[Int]) = xs match {
<span class="linenr">3: </span>case x <span style="color: #b294bb;">::</span> y <span style="color: #b294bb;">::</span> _ =&gt; y
<span class="linenr">4: </span>}
<span class="linenr">5: </span>def isDefinedAt(xs: List[Int]) = xs match {
<span class="linenr">6: </span>case x <span style="color: #b294bb;">::</span> y <span style="color: #b294bb;">::</span> _ =&gt; true
<span class="linenr">7: </span>case _ =&gt; false
<span class="linenr">8: </span>}
<span class="linenr">9: </span>}
</pre>
</div>
<p>
只要出现PartialFunction的地方就会进行这样的翻译，如果申明为Function1或
没有类型，(只有 =&gt; )则翻译成全函数。
</p>

<ul class="org-ul">
<li>for表达式中的模式匹配
</li>
</ul>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="linenr"> 1: </span>scala&gt; for ((country, city) &lt;capitals)
<span class="linenr"> 2: </span>println(<span style="color: #8abeb7;">"The capital of "</span>+ country +<span style="color: #8abeb7;">" is "</span>+ city)
<span class="linenr"> 3: </span>The capital of France is Paris
<span class="linenr"> 4: </span>The capital of Japan is Tokyo
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>scala&gt; val results = List(Some(<span style="color: #8abeb7;">"apple"</span>), None,
<span class="linenr"> 7: </span>Some(<span style="color: #8abeb7;">"orange"</span>))
<span class="linenr"> 8: </span>results: List[Option[java.lang.String]] = List(Some(apple),
<span class="linenr"> 9: </span>None, Some(orange))
<span class="linenr">10: </span>scala&gt; for (Some(fruit) &lt;results)
<span class="linenr">11: </span>println(fruit)
<span class="linenr">12: </span>apple
<span class="linenr">13: </span>orange
</pre>
</div>
<p>
第2个例子，可以明显看到模式匹配的痕迹。
</p>
</div>
</div>

<div id="outline-container-sec-0-4" class="outline-3">
<h3 id="sec-0-4">不可变的数据结构(immutable data structure)</h3>
<div class="outline-text-3" id="text-0-4">
<p>
scala提供了函数式编程语言重要的基石，那就是不可变的数据结构。并且，
scala在java API的基础上提供了很多不可变的数据类型，如List、Tuple、Map
和Set。
</p>
</div>
</div>

<div id="outline-container-sec-0-5" class="outline-3">
<h3 id="sec-0-5">引用透明性(referencially transparent)</h3>
<div class="outline-text-3" id="text-0-5">
<p>
函数编程的思想还包括：方法或称函数不应该有副作用(side effects)，这些方
法只是通过参数和返回结果与他们的环境进行交互。这样的方法称为引用透明性，
那意味着，对于给定的输入，方法调用能用它的返回结果替换，而不会影响程序
的语义。
举例如下：
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="linenr"> 1: </span>def add(x: Int, y: Int): Int = {
<span class="linenr"> 2: </span>   x + y
<span class="linenr"> 3: </span>}
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span>val (a, b) = (13,14)
<span id="coderef-add" class="coderef-off"><span class="linenr"> 6: </span>val c = add(a,b)</span>
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>def add2(x: Int, y: Int): Int = {
<span class="linenr"> 9: </span>    println(<span style="color: #8abeb7;">"a + b = "</span> + (x + y))
<span class="linenr">10: </span>    x + y
<span class="linenr">11: </span>}
<span class="linenr">12: </span>
<span id="coderef-add2" class="coderef-off"><span class="linenr">13: </span>val c = add2(a,b)</span>
</pre>
</div>
<p>
在第 <a href="#coderef-add"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-add');" onmouseout="CodeHighlightOff(this, 'coderef-add');">6</a> 行调用 add 函数调用的位置，可用 27 代替，不会影响程序的语义，
而在 第 <a href="#coderef-add2"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-add2');" onmouseout="CodeHighlightOff(this, 'coderef-add2');">13</a> 行，如果用 27 代替 add2 函数调用，就与程序原有的语
义不一致，因为函数add2()有副作用：打印语句。
</p>
</div>
</div>

<div id="outline-container-sec-0-6" class="outline-3">
<h3 id="sec-0-6">trait</h3>
<div class="outline-text-3" id="text-0-6">
<p>
Scala 使用trait，使其看起来有点像多重继承，值得提到的，有如下几点，第一，
trait像Java的接口，而它们也有方法实现，具有&lt;松本行弘的程序世界&gt;说的
 实现继承(另一种继承叫规格继承，如class)能力，甚至有成员变量(fields)；第二，
不像类，trait能加新的功能到一个未确定的超类中；第三，对super的解释，多
重继承中，被super调用的方法在调用的位置确定，但是使用trait，被调用的方
法通过类的线性化(linearizatioin)来确定并将traits混合进类中，也即trait
的super调用，如super.toString()，是动态绑定的，而abstract class或class
是静态绑定的，就这个区别使能了以堆栈方式进行修改，举例如下：
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="linenr"> 1: </span>abstract class IntQueue {
<span class="linenr"> 2: </span>  def get(): Int
<span class="linenr"> 3: </span>  def put(x: Int)
<span class="linenr"> 4: </span>}
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>import scala.collection.mutable.ArrayBuffer
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>class BasicIntQueue extends IntQueue {
<span class="linenr"> 9: </span>  private val buf = new ArrayBuffer[Int]
<span class="linenr">10: </span>  def get() = buf.remove(0)
<span class="linenr">11: </span>  def put(x: Int) { buf += x }
<span class="linenr">12: </span>}
<span class="linenr">13: </span>
<span class="linenr">14: </span>trait Doubling extends IntQueue {
<span id="coderef-double" class="coderef-off"><span class="linenr">15: </span>  abstract override def put(x: Int) { super.put(2 * x) }</span>
<span class="linenr">16: </span>}
<span class="linenr">17: </span>
<span class="linenr">18: </span>trait Incrementing extends IntQueue { 
<span id="coderef-incrementing" class="coderef-off"><span class="linenr">19: </span>  abstract override def put(x: Int)</span>
<span id="coderef-super-put" class="coderef-off"><span class="linenr">20: </span>      { super.put(x + 1) }</span>
<span class="linenr">21: </span>}
<span class="linenr">22: </span>
<span class="linenr">23: </span>trait Filtering extends IntQueue {
<span id="coderef-filtering" class="coderef-off"><span class="linenr">24: </span>  abstract override def put(x: Int) {</span>
<span class="linenr">25: </span>    if (x &gt;= 0) super.put(x) 
<span class="linenr">26: </span>  }
<span class="linenr">27: </span>}
<span class="linenr">28: </span>
<span id="coderef-stack1" class="coderef-off"><span class="linenr">29: </span>scala&gt; val q = new BasicIntQueue with Doubling with Incrementing</span>
<span class="linenr">30: </span>q: BasicIntQueue with Doubling with Incrementing = $anon$1@60c8fab
<span class="linenr">31: </span>
<span class="linenr">32: </span>scala&gt; q.put(42)
<span class="linenr">33: </span>
<span class="linenr">34: </span>scala&gt; q.get()
<span class="linenr">35: </span>res12: Int = 86
<span class="linenr">36: </span>
<span id="coderef-stack2" class="coderef-off"><span class="linenr">37: </span>scala&gt; val q = new BasicIntQueue with Incrementing with Doubling</span>
<span class="linenr">38: </span>q: BasicIntQueue with Incrementing with Doubling = $anon$1@2a7a3919
<span class="linenr">39: </span>
<span class="linenr">40: </span>scala&gt; q.put(42)
<span class="linenr">41: </span>
<span class="linenr">42: </span>scala&gt; q.get()
<span class="linenr">43: </span>res14: Int = 85
</pre>
</div>
<p>
line <a href="#coderef-stack1"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-stack1');" onmouseout="CodeHighlightOff(this, 'coderef-stack1');">29</a>  和 line <a href="#coderef-stack2"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-stack2');" onmouseout="CodeHighlightOff(this, 'coderef-stack2');">37</a> 的 with Doubling with
Incrementing 和 with Incrementing with Doubling， 顺序的不同，所产生的
结果是不同的，明显地看到堆栈的痕迹，同时也可以理解super为什么需要动态
绑定，如line <a href="#coderef-super-put"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-super-put');" onmouseout="CodeHighlightOff(this, 'coderef-super-put');">20</a> 的 super.put，由于自己在继承类中位置的不
同，所使用的super肯定不同。
</p>

<p>
另外，代码中的line <a href="#coderef-double"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-double');" onmouseout="CodeHighlightOff(this, 'coderef-double');">15</a> <a href="#coderef-incrementing"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-incrementing');" onmouseout="CodeHighlightOff(this, 'coderef-incrementing');">19</a> <a href="#coderef-filtering"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-filtering');" onmouseout="CodeHighlightOff(this, 'coderef-filtering');">24</a>
使用了 abstract override 是专门用于修改超类中某一方法时，所必须的特定语
法。
</p>
</div>
</div>
