org/2014-04-16-scala.org
** 协变和逆变
引入协变、逆变和不变，主要基于Java支持协变所引起的编译时和运行时的不一
致所带来的问题，如下的Java代码，编译时ok，但运行时出现
ArrayStoreException。
#+BEGIN_SRC emacs-lisp -n -r
// this is Java
String[] a1 = { "abc" };
Object[] a2 = a1;
a2[0] = new Integer(17); (ref:assign)
#+END_SRC
在运行时，第[[(assign)]] 行引发如下错误:
#+BEGIN_EXAMPLE
Exception in thread "main" java.lang.ArrayStoreException:
java.lang.Integer
at JavaArrays.main(JavaArrays.java:8)
#+END_EXAMPLE
这是因为在运行时，Java存储数组的元素类型，然后，在每次数组元素被更新时，
将检查新元素值的存储类型，如果该值不是那个类型的实例，就会抛出
ArrayStoreException。为了解决这样的问题，在Scala中，Array是不变的，即
#+BEGIN_SRC emacs-lisp -n -r
// this is Scala
String[] a1 = { "abc" };
Object[] a2 = a1;
#+END_SRC
上述代码，在第2行，会引起编译错误。

- 子类型(subtype) 在需要父类型的地方，scala编译器允许将其替换为子类型
中的任何一个。对于没有类型参数的class或trait，子类型关系与子类关系对应，
对于有类型参数的class或trait，如果类型参数标注为协变或逆变，则按不同的
方向形成有子类型关系，如果类型参数没有标注，则不会形成子类型关系。

- 协变(covariant) 一个协变标注能通过下面的方式应用到class或trait的类型参
  数中，即在类型参数前面添加加号"+"。根据定义，class或traitn将根据标注
  参数的类型来确定协变意义上的子类型方向。如List类型是协变的，因
  此List[String]是List[Any]的子类型。

- 逆变(contravariant) 一个逆变标注能通过下面的方式应用到class或trait的类型参
  数中，即在类型参数前面添加加号"+"。根据定义，class或traitn将根据标注
  参数的类型来确定逆变意义上的子类型方向。如Function1的第一个参数类型
  是逆变的，因此Function1[Any, Any]是Function1[String, Any]的子类性。

逆变和协变的应用例子，在scala的实现中非常多，如Function1的定义(取自2.9.2)

#+BEGIN_SRC emacs-lisp -n -r
//PartialFunction.scala version 
trait Function1[-A, +B] extends AnyRef {
   ...
}
#+END_SRC
- Function1类型参数的第参数 第一个类型为“-A”，意味着逆变，第2个为协变，
  根据定义，可以得到如下公理：

  | T1' <: T1                                |
  | T2 <: T2'                                |
  |------------------------------------------|
  | Function1[T1, T2] <: Function1[T1', T2'] |

Function1的参数类型定义，明确了一个规则：所有的输入都应该为负位置
(negative positions)，所有输出为正位置(positive positions)。

考虑含有多个case的情况，case之间必须符合先子类，后父类的原则，否则导致
  不可达的异常情况，
#+BEGIN_SRC emacs-lisp -n -r
 class A
 class B extends A
 class C extends B
 scala> val withDefault: A => B = {
 | case x:B => new B
 | case x:A => new B }
 withDefault: A => B = <function1>
#+END_SRC
在上面的代码中，case x:B 一定要出现在 case x:A的前面，否则会导致不可达
的编译错误。另外：  Function1[A,B] <: Function1[B,B] 

- 为什么设置成contravariant [fn:6]

假设如下继承关系：
#+BEGIN_SRC emacs-lisp -n -r
Animal <- Duck
Animal <- Dog
Duck <- WhiteDuck
Duck <- BlackDuck
#+END_SRC
且有一个函数 =funcWithFuncParam(x: Duck => Int)(y: Duck)= 需要一个函数
~Duck => Int~ 作为它的参数，如果 ~WhiteDuck => Int~ 是 ~Duck =>
Int~ 的子类型( ~WhiteDuck <: Duck~ )，且能够传递给该函
数~funcWithFuncParam~，则如下代码成立:
#+BEGIN_SRC emacs-lisp -n -r
def funcWhiteDuck(x: WhiteDuck): Int = {8}
val f1 = funcWithFuncParam(funcWhiteDuck) _ 
f1(new WhiteDuck) 
#+END_SRC
有因为 ~Duck => Int~ 且 WhiteDuck 和 BlackDuck都是Duck的子类，因
此 ~f1(new BlackDuck)~ 也应该可以执行，这显然是不合法的，就像 val
x:Integet = "string" 一样不合法。当然Scala不允许出现上面的情况，因
此， ~Animal => Int~ 才是 ~Duck =>Int~ 的子类，如下代码才能在Scala中运行，并符合子类“是一“个父类的原则。

#+BEGIN_SRC emacs-lisp -n -r
Animal <- Duck
Animal <- Dog
Duck <- WhiteDuck
Duck <- BlackDuck

scala> def funcWithFuncParam(x: Duck => Int) (y:Duck){
     | x(y) }
funcWithFuncParam: (x: Duck => Int)(y: Duck)Unit

scala> def funcAnimal(x: Animal): Int = {8}
funcAnimal: (x: Animal)Int

scala> def funcDuck(x: Duck): Int = {8}
funcDuck: (x: Duck)Int

scala> def funcWhiteDuck(x: WhiteDuck): Int = {8}
funcWhiteDuck: (x: WhiteDuck)Int

scala> val f1 = funcWithFuncParam(funcAnimal) _
f1: Duck => Unit = <function1>

scala> f1(new Duck)
scala> f1(new WhiteDuck)
scala> f1(new BlackDuck) 
#+END_SRC

- 下届 和 上届

通过对Function1定义的分析，知道下面的定义：
#+BEGIN_SRC java -n -r
class Queue[+T] 
{
    def enqueue(x: T) = {} (ref:enqueue) 
}
#+END_SRC
第[[(enqueue)]]行会出现编译错误，因为函数参数是输入的一种方式，错误如下：
#+BEGIN_SRC 
error: covariant type T occurs in contravariant position in type T of value x
       def enqueue(x: T) = {}
                   ^
#+END_SRC
要解决这个问题，必须使用lower bounds技术，
#+BEGIN_SRC java -n -r
class Queue[+T] {
    def enqueue[U>:T](x : U) = new Queue[U]()
}

class Fruit
class Apple extends Fruit
class Orange extends Fruit
class Another
}
#+END_SRC
语法为 *U >: T* 使得 enqueue的参数类型现在为 U，U 是 T 的超类型，保证
不会出现运行时错误。例如上面的例子中，可以有如下使用:
#+BEGIN_SRC java -n -r
val q1 = new Queue[Fruit]
    q1.enqueue(new Apple)
    q1.enqueue(new Orange) (ref:orange)
    q1.enqueue(new Another) (ref:another)
#+END_SRC
第 [[(orange)]], [[(another)]] 行，好像不对，经分析，Orange的超类为Fruit，
Fruit是Fruit的超类，因此没有问题，而Another的超类为Any，Any为Fruit的超
类，也符合条件。

upper bounds 与下届类似，可以通过PinS page 444的一个例子：
#+BEGIN_SRC java -n -r
def orderedMergeSort[T <: Ordered[T]](xs: List[T]): List[T] = {
#+END_SRC

- 对象私有数据
也是通过对Function1的定义，输入输出必须遵循正负位置，因此在定义类或
trait，不能出现公共的可修改的变量(使用var定义的变量)，它会引起使用者的
非法修改。如需要定义这样的变量，必须像如下一样定义：
#+BEGIN_SRC java -r -n
class Queue[+T] private (
private[this] var leading: List[T],
private[this] var trailing: List[T]
) {}
#+END_SRC
使用了关键字 *private[this]* 。

