_posts/2014-04-16-scala.html

<div id="outline-container-sec-0-7" class="outline-3">
<h3 id="sec-0-7">协变和逆变</h3>
<div class="outline-text-3" id="text-0-7">
<p>
引入协变、逆变和不变，主要基于Java支持协变所引起的编译时和运行时的不一
致所带来的问题，如下的Java代码，编译时ok，但运行时出现
ArrayStoreException。
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="linenr">1: </span>// this is Java
<span class="linenr">2: </span>String[] a1 = { <span style="color: #8abeb7;">"abc"</span> }<span style="color: #969896; font-style: italic;">;</span>
<span class="linenr">3: </span>Object[] a2 = a1<span style="color: #969896; font-style: italic;">;</span>
<span id="coderef-assign" class="coderef-off"><span class="linenr">4: </span>a2[0] = new Integer(17)<span style="color: #969896; font-style: italic;">;</span></span>
</pre>
</div>
<p>
在运行时，第<a href="#coderef-assign"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-assign');" onmouseout="CodeHighlightOff(this, 'coderef-assign');">4</a> 行引发如下错误:
</p>
<pre class="example">
Exception in thread "main" java.lang.ArrayStoreException:
java.lang.Integer
at JavaArrays.main(JavaArrays.java:8)
</pre>
<p>
这是因为在运行时，Java存储数组的元素类型，然后，在每次数组元素被更新时，
将检查新元素值的存储类型，如果该值不是那个类型的实例，就会抛出
ArrayStoreException。为了解决这样的问题，在Scala中，Array是不变的，即
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="linenr">1: </span>// this is Scala
<span class="linenr">2: </span>String[] a1 = { <span style="color: #8abeb7;">"abc"</span> }<span style="color: #969896; font-style: italic;">;</span>
<span class="linenr">3: </span>Object[] a2 = a1<span style="color: #969896; font-style: italic;">;</span>
</pre>
</div>
<p>
上述代码，在第2行，会引起编译错误。
</p>

<ul class="org-ul">
<li>子类型(subtype) 在需要父类型的地方，scala编译器允许将其替换为子类型
</li>
</ul>
<p>
中的任何一个。对于没有类型参数的class或trait，子类型关系与子类关系对应，
对于有类型参数的class或trait，如果类型参数标注为协变或逆变，则按不同的
方向形成有子类型关系，如果类型参数没有标注，则不会形成子类型关系。
</p>

<ul class="org-ul">
<li>协变(covariant) 一个协变标注能通过下面的方式应用到class或trait的类型参
数中，即在类型参数前面添加加号"+"。根据定义，class或traitn将根据标注
参数的类型来确定协变意义上的子类型方向。如List类型是协变的，因
此List[String]是List[Any]的子类型。
</li>

<li>逆变(contravariant) 一个逆变标注能通过下面的方式应用到class或trait的类型参
数中，即在类型参数前面添加加号"+"。根据定义，class或traitn将根据标注
参数的类型来确定逆变意义上的子类型方向。如Function1的第一个参数类型
是逆变的，因此Function1[Any, Any]是Function1[String, Any]的子类性。
</li>
</ul>

<p>
逆变和协变的应用例子，在scala的实现中非常多，如Function1的定义(取自2.9.2)
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="linenr">1: </span>//PartialFunction.scala version 
<span class="linenr">2: </span>trait Function1[-A, +B] extends AnyRef {
<span class="linenr">3: </span>   ...
<span class="linenr">4: </span>}
</pre>
</div>
<ul class="org-ul">
<li>Function1类型参数的第参数 第一个类型为“-A”，意味着逆变，第2个为协变，
根据定义，可以得到如下公理：

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">T1' &lt;: T1</th>
</tr>

<tr>
<th scope="col" class="left">T2 &lt;: T2'</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Function1[T1, T2] &lt;: Function1[T1', T2']</td>
</tr>
</tbody>
</table>
</li>
</ul>

<p>
Function1的参数类型定义，明确了一个规则：所有的输入都应该为负位置
(negative positions)，所有输出为正位置(positive positions)。
</p>

<p>
考虑含有多个case的情况，case之间必须符合先子类，后父类的原则，否则导致
  不可达的异常情况，
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="linenr">1: </span>class A
<span class="linenr">2: </span>class B extends A
<span class="linenr">3: </span>class C extends B
<span class="linenr">4: </span>scala&gt; val withDefault: A =&gt; B = {
<span class="linenr">5: </span>| case x:B =&gt; new B
<span class="linenr">6: </span>| case x:A =&gt; new B }
<span class="linenr">7: </span>withDefault: A =&gt; B = &lt;function1&gt;
</pre>
</div>
<p>
在上面的代码中，case x:B 一定要出现在 case x:A的前面，否则会导致不可达
的编译错误。另外：  Function1[A,B] &lt;: Function1[B,B] 
</p>

<ul class="org-ul">
<li>为什么设置成contravariant <sup><a id="fnr.5" name="fnr.5" class="footref" href="#fn.5">5</a></sup>
</li>
</ul>

<p>
假设如下继承关系：
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="linenr">1: </span>Animal &lt;- Duck
<span class="linenr">2: </span>Animal &lt;- Dog
<span class="linenr">3: </span>Duck &lt;- WhiteDuck
<span class="linenr">4: </span>Duck &lt;- BlackDuck
</pre>
</div>
<p>
且有一个函数 <code>funcWithFuncParam(x: Duck =&gt; Int)(y: Duck)</code> 需要一个函数
<code>Duck =&gt; Int</code> 作为它的参数，如果 <code>WhiteDuck =&gt; Int</code> 是 <code>Duck =&gt;
Int</code> 的子类型( <code>WhiteDuck &lt;: Duck</code> )，且能够传递给该函
数~funcWithFuncParam~，则如下代码成立:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="linenr">1: </span>def funcWhiteDuck(x: WhiteDuck): Int = {8}
<span class="linenr">2: </span>val f1 = funcWithFuncParam(funcWhiteDuck) _ 
<span class="linenr">3: </span>f1(new WhiteDuck)
</pre>
</div>
<p>
有因为 <code>Duck =&gt; Int</code> 且 WhiteDuck 和 BlackDuck都是Duck的子类，因
此 <code>f1(new BlackDuck)</code> 也应该可以执行，这显然是不合法的，就像 val
x:Integet = "string" 一样不合法。当然Scala不允许出现上面的情况，因
此， <code>Animal =&gt; Int</code> 才是 <code>Duck =&gt;Int</code> 的子类，如下代码才能在Scala中运行，并符合子类“是一“个父类的原则。
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="linenr"> 1: </span>Animal &lt;- Duck
<span class="linenr"> 2: </span>Animal &lt;- Dog
<span class="linenr"> 3: </span>Duck &lt;- WhiteDuck
<span class="linenr"> 4: </span>Duck &lt;- BlackDuck
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span>scala&gt; def funcWithFuncParam(x: Duck =&gt; Int) (y:Duck){
<span class="linenr"> 7: </span>     | x(y) }
<span class="linenr"> 8: </span>funcWithFuncParam: (x: Duck =&gt; Int)(y: Duck)Unit
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>scala&gt; def funcAnimal(x: Animal): Int = {8}
<span class="linenr">11: </span>funcAnimal: (x: Animal)Int
<span class="linenr">12: </span>
<span class="linenr">13: </span>scala&gt; def funcDuck(x: Duck): Int = {8}
<span class="linenr">14: </span>funcDuck: (x: Duck)Int
<span class="linenr">15: </span>
<span class="linenr">16: </span>scala&gt; def funcWhiteDuck(x: WhiteDuck): Int = {8}
<span class="linenr">17: </span>funcWhiteDuck: (x: WhiteDuck)Int
<span class="linenr">18: </span>
<span class="linenr">19: </span>scala&gt; val f1 = funcWithFuncParam(funcAnimal) _
<span class="linenr">20: </span>f1: Duck =&gt; Unit = &lt;function1&gt;
<span class="linenr">21: </span>
<span class="linenr">22: </span>scala&gt; f1(new Duck)
<span class="linenr">23: </span>scala&gt; f1(new WhiteDuck)
<span class="linenr">24: </span>scala&gt; f1(new BlackDuck)
</pre>
</div>

<ul class="org-ul">
<li>下届 和 上届
</li>
</ul>

<p>
通过对Function1定义的分析，知道下面的定义：
</p>
<div class="org-src-container">

<pre class="src src-java"><span class="linenr">1: </span><span style="color: #b5bd68;">class</span> <span style="color: #81a2be;">Queue</span>[+T] 
<span class="linenr">2: </span>{
<span id="coderef-enqueue" class="coderef-off"><span class="linenr">3: </span>    <span style="color: #81a2be;">def</span> <span style="color: #f0c674;">enqueue</span>(x: T) = {}</span>
<span class="linenr">4: </span>}
</pre>
</div>
<p>
第<a href="#coderef-enqueue"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-enqueue');" onmouseout="CodeHighlightOff(this, 'coderef-enqueue');">3</a>行会出现编译错误，因为函数参数是输入的一种方式，错误如下：
</p>
<pre class="example">
error: covariant type T occurs in contravariant position in type T of value x
       def enqueue(x: T) = {}
                   ^
</pre>
<p>
要解决这个问题，必须使用lower bounds技术，
</p>
<div class="org-src-container">

<pre class="src src-java"><span class="linenr">1: </span><span style="color: #b5bd68;">class</span> <span style="color: #81a2be;">Queue</span>[+T] {
<span class="linenr">2: </span>    <span style="color: #81a2be;">def</span> <span style="color: #f0c674;">enqueue</span>[U&gt;:T](x : U) = <span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">Queue</span>[U]()
<span class="linenr">3: </span>}
<span class="linenr">4: </span>
<span class="linenr">5: </span><span style="color: #b5bd68;">class</span> <span style="color: #81a2be;">Fruit</span>
<span class="linenr">6: </span><span style="color: #b5bd68;">class</span> Apple <span style="color: #b5bd68;">extends</span> <span style="color: #81a2be;">Fruit</span>
<span class="linenr">7: </span><span style="color: #b5bd68;">class</span> Orange <span style="color: #b5bd68;">extends</span> <span style="color: #81a2be;">Fruit</span>
<span class="linenr">8: </span><span style="color: #b5bd68;">class</span> Another
<span class="linenr">9: </span>}
</pre>
</div>
<p>
语法为 <b>U &gt;: T</b> 使得 enqueue的参数类型现在为 U，U 是 T 的超类型，保证
不会出现运行时错误。例如上面的例子中，可以有如下使用:
</p>
<div class="org-src-container">

<pre class="src src-java"><span class="linenr">1: </span><span style="color: #81a2be;">val</span> <span style="color: #f0c674;">q1</span> = <span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">Queue</span>[Fruit]
<span class="linenr">2: </span>    q1.enqueue(<span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">Apple</span>)
<span id="coderef-orange" class="coderef-off"><span class="linenr">3: </span>    q1.enqueue(<span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">Orange</span>)</span>
<span id="coderef-another" class="coderef-off"><span class="linenr">4: </span>    q1.enqueue(<span style="color: #b5bd68;">new</span> <span style="color: #81a2be;">Another</span>)</span>
</pre>
</div>
<p>
第 <a href="#coderef-orange"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-orange');" onmouseout="CodeHighlightOff(this, 'coderef-orange');">3</a>, <a href="#coderef-another"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-another');" onmouseout="CodeHighlightOff(this, 'coderef-another');">4</a> 行，好像不对，经分析，Orange的超类为Fruit，
Fruit是Fruit的超类，因此没有问题，而Another的超类为Any，Any为Fruit的超
类，也符合条件。
</p>

<p>
upper bounds 与下届类似，可以通过PinS page 444的一个例子：
</p>
<div class="org-src-container">

<pre class="src src-java"><span class="linenr">1: </span><span style="color: #81a2be;">def</span> <span style="color: #f0c674;">orderedMergeSort</span>[T &lt;: Ordered[T]](xs: List[T]): List[T] = {
</pre>
</div>

<ul class="org-ul">
<li>对象私有数据
</li>
</ul>
<p>
也是通过对Function1的定义，输入输出必须遵循正负位置，因此在定义类或
trait，不能出现公共的可修改的变量(使用var定义的变量)，它会引起使用者的
非法修改。如需要定义这样的变量，必须像如下一样定义：
</p>
<div class="org-src-container">

<pre class="src src-java"><span class="linenr">1: </span><span style="color: #b5bd68;">class</span> <span style="color: #81a2be;">Queue</span>[+T] <span style="color: #b5bd68;">private</span> (
<span class="linenr">2: </span><span style="color: #b5bd68;">private</span>[<span style="color: #b5bd68;">this</span>] var leading: List[T],
<span class="linenr">3: </span><span style="color: #b5bd68;">private</span>[<span style="color: #b5bd68;">this</span>] var trailing: List[T]
<span class="linenr">4: </span>) {}
</pre>
</div>
<p>
使用了关键字 <b>private[this]</b> 。
</p>
</div>
</div>
