org/2014-04-16-scala.org
** 部分应用函数
部分应用函数(Partially Applied function) 一个用在表达式中且缺少一些参
数的函数，定义部分应用函数时，使用下划杠来完成。如一个函数f的类型为Int => Int => Int，那么 f 和 f(1) 是部分
应用函数。
#+BEGIN_SRC emacs-lisp -n -r
scala> def sum(x: Int, y: Int, z: Int) = x + y + z
sum: (x: Int, y: Int, z: Int)Int

scala> val a = sum(2,_:Int,3)
a: Int => Int = <function1>

scala> val b = sum(2,_:Int,_:Int)
a: (Int, Int) => Int = <function2>

scala> val c = sum _
c: (Int, Int, Int) => Int = <function3>

#+END_SRC

* 不同于Java的特点
** object关键字
- singleton object
用object关键字定义的对象，称为singleton对象。每个singleton object有且
只有一个实例。一个singleton object 与一个class拥有同样的名字，并且被定
义在同一个源文件中，称为那个class的同伴对象(companion object)。这个
class称为它的同伴类。一个没有同伴类的singleton object称为standalone
object。

与singleton object相关的是，在scala中没有静态成员。
