_posts/2014-04-16-scala.html

<div id="outline-container-sec-0-8" class="outline-3">
<h3 id="sec-0-8">部分应用函数</h3>
<div class="outline-text-3" id="text-0-8">
<p>
部分应用函数(Partially Applied function) 一个用在表达式中且缺少一些参
数的函数，定义部分应用函数时，使用下划杠来完成。如一个函数f的类型为Int =&gt; Int =&gt; Int，那么 f 和 f(1) 是部分
应用函数。
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="linenr"> 1: </span>scala&gt; def sum(x: Int, y: Int, z: Int) = x + y + z
<span class="linenr"> 2: </span>sum: (x: Int, y: Int, z: Int)Int
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span>scala&gt; val a = sum(2,_:Int,3)
<span class="linenr"> 5: </span>a: Int =&gt; Int = &lt;function1&gt;
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>scala&gt; val b = sum(2,_:Int,_:Int)
<span class="linenr"> 8: </span>a: (Int, Int) =&gt; Int = &lt;function2&gt;
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>scala&gt; val c = sum _
<span class="linenr">11: </span>c: (Int, Int, Int) =&gt; Int = &lt;function3&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">不同于Java的特点</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">object关键字</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>singleton object
</li>
</ul>
<p>
用object关键字定义的对象，称为singleton对象。每个singleton object有且
只有一个实例。一个singleton object 与一个class拥有同样的名字，并且被定
义在同一个源文件中，称为那个class的同伴对象(companion object)。这个
class称为它的同伴类。一个没有同伴类的singleton object称为standalone
object。
</p>

<p>
与singleton object相关的是，在scala中没有静态成员。
</p>
</div>
</div>
